#자주 쓰는 설정값 저장

import os

from dotenv import load_dotenv


load_dotenv()

API_KEY = os.getenv("DATA_API_KEY")


ROUTES = {
    "5001A": "41006433",
    "5001B": "41006248",
}

STATIONS_5001A = [
    {"seq": 15, "id": "4111680", "name": "시청.용인대역", "ctpv_cd": "41", "sgg_cd": "41461"},
    {"seq": 16, "id": "4111677", "name": "진우.늘푸른오스카빌.우남퍼스트빌아파트", "ctpv_cd": "41", "sgg_cd": "41461"},
    {"seq": 17, "id": "4196105", "name": "삼가동.궁촌", "ctpv_cd": "41", "sgg_cd": "41461"},
    {"seq": 18, "id": "4111675", "name": "삼가역.두산위브", "ctpv_cd": "41", "sgg_cd": "41461"},

    {"seq": 19, "id": "4111672", "name": "효자고개", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 20, "id": "4111670", "name": "인정프린스.흥국생명연수원", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 21, "id": "4111669", "name": "수원동.쌍용아파트", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 22, "id": "4111667", "name": "상지석.대우.진흥아파트", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 23, "id": "4111665", "name": "고인돌.하나로마트.현대출고장", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 24, "id": "4111662", "name": "어정삼거리.강남마을", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 25, "id": "4111660", "name": "강남대역.강남대입구", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 26, "id": "4111659", "name": "수원컨트리클럽", "ctpv_cd": "41", "sgg_cd": "41463"},
    {"seq": 27, "id": "4111657", "name": "기흥역6번출구", "ctpv_cd": "41", "sgg_cd": "41463"},
]



STATIONS_5001B = [
    {
        "seq": 40,
        "id": "4109887",
        "name": "매헌시민의숲(중)",
        "ctpv_cd": "11",
        "sgg_cd": "11650"
    },
    {
        "seq": 41,
        "id": "4151626",
        "name": "말죽거리공원사거리(중)",
        "ctpv_cd": "11",
        "sgg_cd": "11650"
    },
    {
        "seq": 42,
        "id": "4151629",
        "name": "양재역.서초문화예술회관(중)",
        "ctpv_cd": "11",
        "sgg_cd": "11650"
    },
    {
        "seq": 43,
        "id": "4151633",
        "name": "뱅뱅사거리(중)",
        "ctpv_cd": "11",
        "sgg_cd": "11680"
    },
    {
        "seq": 44,
        "id": "4151635",
        "name": "래미안아파트.파이낸셜뉴스(중)",
        "ctpv_cd": "11",
        "sgg_cd": "11680"
    },
    {
        "seq": 45,
        "id": "4151638",
        "name": "신분당선강남역",
        "ctpv_cd": "11",
        "sgg_cd": "11680"
    },
    {
        "seq": 46,
        "id": "4105915",
        "name": "신논현역",
        "ctpv_cd": "11",
        "sgg_cd": "11680"
    },
]